Тестовая_база_ERP_14/src/Catalogs/СпособыОтраженияЗарплатыВБухУчете/СпособыОтраженияЗарплатыВБухУчете.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СпособыОтраженияЗарплатыВБухУчете</name>
  <attributes>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходовЕНВД</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходовЕНВД</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсобыйСоответствуетОсновному</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаАктивовПассивов</name>
    <type>
      <types>Characteristic.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаАктивовПассивовЕНВД</name>
    <type>
      <types>Characteristic.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимУчетаВзносов</name>
    <comment>0 - совпадает с зарплатой, 1 - все взносы на отдельной статье</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимУчетаВзносовЕНВД</name>
    <comment>0 - совпадает с зарплатой, 1 - все взносы на отдельной статье</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаЕНВД</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто1ЕНВД</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто2ЕНВД</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто3ЕНВД</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПрочиеОперации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходовВзносов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходовВзносов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаАктивовПассивовВзносов</name>
    <type>
      <types>Characteristic.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаВзносов</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто1Взносов</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто2Взносов</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто3Взносов</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходовВзносовЕНВД</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходовВзносовЕНВД</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаАктивовПассивовВзносовЕНВД</name>
    <type>
      <types>Characteristic.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаВзносовЕНВД</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто1ВзносовЕНВД</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто2ВзносовЕНВД</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаСдельныхРабот</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтдельнаяСтатьяКалькуляции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяКалькуляции</name>
    <type>
      <types>CatalogRef.СтатьиКалькуляции</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтдельнаяСтатьяКалькуляцииВзносов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяКалькуляцииВзносов</name>
    <type>
      <types>CatalogRef.СтатьиКалькуляции</types>
    </type>
  </attributes>
  <attributes>
    <name>БазаРаспределенияПоСдельнымРаботам</name>
    <type>
      <types>EnumRef.ТипыБазыРаспределенияРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто3ВзносовЕНВД</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимУчетаВзносовНаТравматизм</name>
    <comment>0 - совпадает с зарплатой, 1 - на отдельную статью</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходовТравматизм</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходовТравматизм</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаАктивовПассивовТравматизм</name>
    <type>
      <types>Characteristic.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаТравматизм</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто1Травматизм</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто2Травматизм</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто3Травматизм</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>ПринятиеКНалоговомуУчетуПоСдельнымРаботам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПринятиеКНалоговомуУчетуПоСдельнымРаботамНеТребуетОбновления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Тестовая_база_ERP_14/src/Enums/ВариантыРаспределенияРасходов/ВариантыРаспределенияРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыРаспределенияРасходов</name>
  <enumValues>
    <name>НаСебестоимостьТоваров</name>
  </enumValues>
  <enumValues>
    <name>НаНаправленияДеятельности</name>
  </enumValues>
  <enumValues>
    <name>НаРасходыБудущихПериодов</name>
  </enumValues>
  <enumValues>
    <name>НаПроизводственныеЗатраты</name>
  </enumValues>
  <enumValues>
    <name>НаПрочиеАктивы</name>
  </enumValues>
  <enumValues>
    <name>НеРаспределять</name>
  </enumValues>
  <enumValues>
    <name>НаВнеоборотныеАктивы</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Enums/ВидыЦенностей/ВидыЦенностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЦенностей</name>
  <enumValues>
    <name>АвансыВыданные</name>
  </enumValues>
  <enumValues>
    <name>АвансыПолученные</name>
  </enumValues>
  <enumValues>
    <name>АвансыПолученные0</name>
  </enumValues>
  <enumValues>
    <name>ВнутреннееПотребление</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
  <enumValues>
    <name>ВозвратАвансовПолученных</name>
  </enumValues>
  <enumValues>
    <name>ИмуществоСУчетомНДС</name>
  </enumValues>
  <enumValues>
    <name>КомандировочныеРасходы</name>
  </enumValues>
  <enumValues>
    <name>Материалы</name>
  </enumValues>
  <enumValues>
    <name>НалоговыйАгентАренда</name>
  </enumValues>
  <enumValues>
    <name>НалоговыйАгентРеализацияИмущества</name>
  </enumValues>
  <enumValues>
    <name>НалоговыйАгентИностранцы</name>
  </enumValues>
  <enumValues>
    <name>НалоговыйАгентЭлектронныеУслуги</name>
  </enumValues>
  <enumValues>
    <name>НалоговыйАгентКомитент</name>
  </enumValues>
  <enumValues>
    <name>НМА</name>
  </enumValues>
  <enumValues>
    <name>Оборудование</name>
  </enumValues>
  <enumValues>
    <name>ОбъектыНезавершенногоСтроительства</name>
  </enumValues>
  <enumValues>
    <name>ОС</name>
  </enumValues>
  <enumValues>
    <name>ПосредническиеУслуги</name>
  </enumValues>
  <enumValues>
    <name>ПредставительскиеРасходы</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеРаботыИУслуги</name>
  </enumValues>
  <enumValues>
    <name>СМРПодрядные</name>
  </enumValues>
  <enumValues>
    <name>СМРСобственнымиСилами</name>
  </enumValues>
  <enumValues>
    <name>СуммыСвязанныеСРасчетамиПоОплате</name>
  </enumValues>
  <enumValues>
    <name>ТаможенныеПлатежи</name>
  </enumValues>
  <enumValues>
    <name>ТаможенныеПлатежиОС</name>
  </enumValues>
  <enumValues>
    <name>Товары</name>
  </enumValues>
  <enumValues>
    <name>ТаможенныйСоюз</name>
  </enumValues>
  <enumValues>
    <name>ТоварыНалоговыйАгент</name>
  </enumValues>
  <enumValues>
    <name>АвансыВыданныеНалоговыйАгент</name>
  </enumValues>
  <enumValues>
    <name>АвансыПолученныеНалоговыйАгент</name>
  </enumValues>
  <enumValues>
    <name>ВозвратАвансовПолученныхНалоговыйАгент</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Catalogs/СпособыОтраженияЗарплатыВБухУчете/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает признак использования статей расходов устаревшего формата в способе отражения зарплаты.
//	Параметры:
//		Объект - СправочникОбъект.СпособыОтраженияЗарплатыВБухУчете - проверяемый способ отражения
//	Возвращаемое значение:
//		Булево - ИСТИНА, если в способе используются статьи расходов с вариантом распределения На прочие активы.
//
Функция ОтражениеПрочихОпераций(Объект) Экспорт
	
	ЭтоОтражениеПрочихОпераций = Ложь;
	
	МассивСтатей = Новый Массив;
	
	Если ТипЗнч(Объект.СтатьяРасходов) = Тип("ПланВидовХарактеристикСсылка.СтатьиРасходов")
		И ЗначениеЗаполнено(Объект.СтатьяРасходов) Тогда
		МассивСтатей.Добавить(Объект.СтатьяРасходов);
	КонецЕсли;
	
	Если ТипЗнч(Объект.СтатьяРасходовЕНВД) = Тип("ПланВидовХарактеристикСсылка.СтатьиРасходов")
		И ЗначениеЗаполнено(Объект.СтатьяРасходовЕНВД) Тогда
		МассивСтатей.Добавить(Объект.СтатьяРасходовЕНВД);
	КонецЕсли;
	
	ПараметрыСтатей = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивСтатей, "ВариантРаспределенияРасходовРегл, ВидЦенностиНДС");
	
	Для Каждого Статья Из ПараметрыСтатей Цикл
		
		Если Статья.Значение.ВариантРаспределенияРасходовРегл = Перечисления.ВариантыРаспределенияРасходов.НаПрочиеАктивы
			И Статья.Значение.ВидЦенностиНДС = Перечисления.ВидыЦенностей.ПрочиеРаботыИУслуги Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

// Возвращает текст запроса для получения параметров способа отражения.
//	Параметры:
//		ИмяВременнойТаблицы - Строка - имя таблицы, если требуется помещения результата во временную таблицу.
//	Возвращаемое значение:
//		Строка - текст запроса.
//
Функция ТекстЗапросаДанныхСпособов(ИмяВременнойТаблицы = "") Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СписокСпособов.СпособОтражения,
	|	ЛОЖЬ КАК ОблагаетсяЕНВД,
	|	СпособОтраженияЗарплата.ОплатаСдельныхРабот КАК ОплатаСдельныхРабот,
	|	СпособОтраженияЗарплата.СтатьяРасходов КАК СтатьяРасходов,
	|	СпособОтраженияЗарплата.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СпособОтраженияЗарплата.СтатьяРасходов.ВариантРаспределенияРасходовРегл КАК ВариантРаспределения,
	|	СпособОтраженияЗарплата.СтатьяРасходов.ПринятиеКналоговомуУчету КАК ПринятиеКналоговомуУчету,
	|	СпособОтраженияЗарплата.АналитикаРасходов КАК АналитикаРасходов,
	|	СпособОтраженияЗарплата.АналитикаАктивовПассивов КАК АналитикаАктивовПассивов,
	|	СпособОтраженияЗарплата.СчетУчета КАК СчетУчета,
	|	СпособОтраженияЗарплата.Субконто1 КАК Субконто1,
	|	СпособОтраженияЗарплата.Субконто2 КАК Субконто2,
	|	СпособОтраженияЗарплата.Субконто3 КАК Субконто3,
	
	|	СпособОтраженияЗарплата.СтатьяРасходовВзносов КАК СтатьяРасходовВзносов,
	|	СпособОтраженияЗарплата.СтатьяРасходовВзносов.ВариантРаспределенияРасходовРегл КАК ВариантРаспределенияВзносов,
	|	СпособОтраженияЗарплата.СтатьяРасходовВзносов.ПринятиеКналоговомуУчету КАК ПринятиеКналоговомуУчетуВзносов,
	|	СпособОтраженияЗарплата.АналитикаРасходовВзносов КАК АналитикаРасходовВзносов,
	|	СпособОтраженияЗарплата.АналитикаАктивовПассивовВзносов КАК АналитикаАктивовПассивовВзносов,
	|	СпособОтраженияЗарплата.СчетУчетаВзносов КАК СчетУчетаВзносов,
	|	СпособОтраженияЗарплата.Субконто1Взносов КАК Субконто1Взносов,
	|	СпособОтраженияЗарплата.Субконто2Взносов КАК Субконто2Взносов,
	|	СпособОтраженияЗарплата.Субконто3Взносов КАК Субконто3Взносов,
	
	// взносы травматизм
	|	СпособОтраженияЗарплата.РежимУчетаВзносовНаТравматизм КАК РежимУчетаВзносовНаТравматизм,
	|	ВЫБОР
	|		КОГДА СпособОтраженияЗарплата.РежимУчетаВзносовНаТравматизм = 1
	|			ТОГДА СпособОтраженияЗарплата.СтатьяРасходовТравматизм
	|		ИНАЧЕ СпособОтраженияЗарплата.СтатьяРасходовВзносов
	|	КОНЕЦ                                    КАК СтатьяРасходовТравматизм,
	|	ВЫБОР
	|		КОГДА СпособОтраженияЗарплата.РежимУчетаВзносовНаТравматизм = 1
	|			ТОГДА СпособОтраженияЗарплата.СтатьяРасходовТравматизм.ВариантРаспределенияРасходовРегл
	|		ИНАЧЕ СпособОтраженияЗарплата.СтатьяРасходовВзносов.ВариантРаспределенияРасходовРегл
	|	КОНЕЦ                                    КАК ВариантРаспределенияТравматизм,
	|	ВЫБОР
	|		КОГДА СпособОтраженияЗарплата.РежимУчетаВзносовНаТравматизм = 1
	|			ТОГДА СпособОтраженияЗарплата.СтатьяРасходовТравматизм.ПринятиеКналоговомуУчету
	|		ИНАЧЕ СпособОтраженияЗарплата.СтатьяРасходовВзносов.ПринятиеКналоговомуУчету
	|	КОНЕЦ                                    КАК ПринятиеКналоговомуУчетуТравматизм,
	|	ВЫБОР
	|		КОГДА СпособОтраженияЗарплата.РежимУчетаВзносовНаТравматизм = 1
	|			ТОГДА СпособОтраженияЗарплата.АналитикаРасходовТравматизм
	|		ИНАЧЕ СпособОтраженияЗарплата.АналитикаРасходовВзносов
	|	КОНЕЦ                                    КАК АналитикаРасходовТравматизм,
	|	ВЫБОР
	|		КОГДА СпособОтраженияЗарплата.РежимУчетаВзносовНаТравматизм = 1
	|			ТОГДА СпособОтраженияЗарплата.АналитикаАктивовПассивовТравматизм
	|		ИНАЧЕ СпособОтраженияЗарплата.АналитикаАктивовПассивовВзносов
	|	КОНЕЦ                                    КАК АналитикаАктивовПассивовТравматизм,
	|	ВЫБОР
	|		КОГДА СпособОтраженияЗарплата.РежимУчетаВзносовНаТравматизм = 1
	|			ТОГДА СпособОтраженияЗарплата.СчетУчетаТравматизм
	|		ИНАЧЕ СпособОтраженияЗарплата.СчетУчетаВзносов
	|	КОНЕЦ                                    КАК СчетУчетаТравматизм,
	|	ВЫБОР
	|		КОГДА СпособОтраженияЗарплата.РежимУчетаВзносовНаТравматизм = 1
	|			ТОГДА СпособОтраженияЗарплата.Субконто1Травматизм
	|		ИНАЧЕ СпособОтраженияЗарплата.Субконто1Взносов
	|	КОНЕЦ                                    КАК Субконто1Травматизм,
	|	ВЫБОР
	|		КОГДА СпособОтраженияЗарплата.РежимУчетаВзносовНаТравматизм = 1
	|			ТОГДА СпособОтраженияЗарплата.Субконто2Травматизм
	|		ИНАЧЕ СпособОтраженияЗарплата.Субконто2Взносов
	|	КОНЕЦ                                    КАК Субконто2Травматизм,
	|	ВЫБОР
	|		КОГДА СпособОтраженияЗарплата.РежимУчетаВзносовНаТравматизм = 1
	|			ТОГДА СпособОтраженияЗарплата.Субконто3Травматизм
	|		ИНАЧЕ СпособОтраженияЗарплата.Субконто3Взносов
	|	КОНЕЦ                                    КАК Субконто3Травматизм
	
	|//ПоместитьВоВременнуюТаблицу
	|ИЗ
	|	ВтСписокСпособовОтражения КАК СписокСпособов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпособыОтраженияЗарплатыВБухУчете КАК СпособОтраженияЗарплата
	|		ПО СписокСпособов.СпособОтражения = СпособОтраженияЗарплата.Ссылка
	|ГДЕ
	|	СписокСпособов.СпособОтражения <> Значение(Справочник.СпособыОтраженияЗарплатыВБухУчете.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СписокСпособов.СпособОтражения,
	|	ИСТИНА,
	|	СпособОтраженияЗарплата.ОплатаСдельныхРабот,
	|	СпособОтраженияЗарплата.СтатьяРасходовЕНВД,
	|	СпособОтраженияЗарплата.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СпособОтраженияЗарплата.СтатьяРасходовЕНВД.ВариантРаспределенияРасходовРегл,
	|	СпособОтраженияЗарплата.СтатьяРасходовЕНВД.ПринятиеКналоговомуУчету,
	|	СпособОтраженияЗарплата.АналитикаРасходовЕНВД,
	|	СпособОтраженияЗарплата.АналитикаАктивовПассивовЕНВД,
	|	СпособОтраженияЗарплата.СчетУчетаЕНВД,
	|	СпособОтраженияЗарплата.Субконто1ЕНВД,
	|	СпособОтраженияЗарплата.Субконто2ЕНВД,
	|	СпособОтраженияЗарплата.Субконто3ЕНВД,
	
	|	СпособОтраженияЗарплата.СтатьяРасходовВзносовЕНВД,
	|	СпособОтраженияЗарплата.СтатьяРасходовВзносовЕНВД.ВариантРаспределенияРасходовРегл,
	|	СпособОтраженияЗарплата.СтатьяРасходовВзносовЕНВД.ПринятиеКналоговомуУчету,
	|	СпособОтраженияЗарплата.АналитикаРасходовВзносовЕНВД,
	|	СпособОтраженияЗарплата.АналитикаАктивовПассивовВзносовЕНВД,
	|	СпособОтраженияЗарплата.СчетУчетаВзносовЕНВД,
	|	СпособОтраженияЗарплата.Субконто1ВзносовЕНВД,
	|	СпособОтраженияЗарплата.Субконто2ВзносовЕНВД,
	|	СпособОтраженияЗарплата.Субконто3ВзносовЕНВД,
	
	// взносы травматизм
	|	СпособОтраженияЗарплата.РежимУчетаВзносовНаТравматизм,
	|	ВЫБОР
	|		КОГДА СпособОтраженияЗарплата.РежимУчетаВзносовНаТравматизм = 1
	|			ТОГДА СпособОтраженияЗарплата.СтатьяРасходовТравматизм
	|		ИНАЧЕ СпособОтраженияЗарплата.СтатьяРасходовВзносовЕНВД
	|	КОНЕЦ                                    КАК СтатьяРасходовТравматизм,
	|	ВЫБОР
	|		КОГДА СпособОтраженияЗарплата.РежимУчетаВзносовНаТравматизм = 1
	|			ТОГДА СпособОтраженияЗарплата.СтатьяРасходовТравматизм.ВариантРаспределенияРасходовРегл
	|		ИНАЧЕ СпособОтраженияЗарплата.СтатьяРасходовВзносовЕНВД.ВариантРаспределенияРасходовРегл
	|	КОНЕЦ                                    КАК ВариантРаспределенияТравматизм,
	|	ВЫБОР
	|		КОГДА СпособОтраженияЗарплата.РежимУчетаВзносовНаТравматизм = 1
	|			ТОГДА СпособОтраженияЗарплата.СтатьяРасходовТравматизм.ПринятиеКналоговомуУчету
	|		ИНАЧЕ СпособОтраженияЗарплата.СтатьяРасходовВзносовЕНВД.ПринятиеКналоговомуУчету
	|	КОНЕЦ                                    КАК ПринятиеКналоговомуУчетуТравматизм,
	|	ВЫБОР
	|		КОГДА СпособОтраженияЗарплата.РежимУчетаВзносовНаТравматизм = 1
	|			ТОГДА СпособОтраженияЗарплата.АналитикаРасходовТравматизм
	|		ИНАЧЕ СпособОтраженияЗарплата.АналитикаРасходовВзносовЕНВД
	|	КОНЕЦ                                    КАК АналитикаРасходовТравматизм,
	|	ВЫБОР
	|		КОГДА СпособОтраженияЗарплата.РежимУчетаВзносовНаТравматизм = 1
	|			ТОГДА СпособОтраженияЗарплата.АналитикаАктивовПассивовТравматизм
	|		ИНАЧЕ СпособОтраженияЗарплата.АналитикаАктивовПассивовВзносовЕНВД
	|	КОНЕЦ                                    КАК АналитикаАктивовПассивовТравматизм,
	|	ВЫБОР
	|		КОГДА СпособОтраженияЗарплата.РежимУчетаВзносовНаТравматизм = 1
	|			ТОГДА СпособОтраженияЗарплата.СчетУчетаТравматизм
	|		ИНАЧЕ СпособОтраженияЗарплата.СчетУчетаВзносовЕНВД
	|	КОНЕЦ                                    КАК СчетУчетаТравматизм,
	|	ВЫБОР
	|		КОГДА СпособОтраженияЗарплата.РежимУчетаВзносовНаТравматизм = 1
	|			ТОГДА СпособОтраженияЗарплата.Субконто1Травматизм
	|		ИНАЧЕ СпособОтраженияЗарплата.Субконто1ВзносовЕНВД
	|	КОНЕЦ                                    КАК Субконто1Травматизм,
	|	ВЫБОР
	|		КОГДА СпособОтраженияЗарплата.РежимУчетаВзносовНаТравматизм = 1
	|			ТОГДА СпособОтраженияЗарплата.Субконто2Травматизм
	|		ИНАЧЕ СпособОтраженияЗарплата.Субконто2ВзносовЕНВД
	|	КОНЕЦ                                    КАК Субконто2Травматизм,
	|	ВЫБОР
	|		КОГДА СпособОтраженияЗарплата.РежимУчетаВзносовНаТравматизм = 1
	|			ТОГДА СпособОтраженияЗарплата.Субконто3Травматизм
	|		ИНАЧЕ СпособОтраженияЗарплата.Субконто3ВзносовЕНВД
	|	КОНЕЦ                                    КАК Субконто3Травматизм
	
	|ИЗ
	|	ВтСписокСпособовОтражения КАК СписокСпособов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпособыОтраженияЗарплатыВБухУчете КАК СпособОтраженияЗарплата
	|		ПО СписокСпособов.СпособОтражения = СпособОтраженияЗарплата.Ссылка
	|ГДЕ
	|	СписокСпособов.СпособОтражения <> Значение(Справочник.СпособыОтраженияЗарплатыВБухУчете.ПустаяСсылка)";
	
	Если ЗначениеЗаполнено(ИмяВременнойТаблицы) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ПоместитьВоВременнуюТаблицу", "ПОМЕСТИТЬ " + ИмяВременнойТаблицы);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ПоместитьВоВременнуюТаблицу", "");
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Возвращает массив блокируемых реквизитов объекта.
//	Возвращаемое значение:
//		Массив - массив реквизитов.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить("НаправлениеДеятельности");
	Результат.Добавить("СтатьяРасходов");
	Результат.Добавить("АналитикаРасходов");
	Результат.Добавить("АналитикаАктивовПассивов");
	Результат.Добавить("РежимУчетаВзносов");
	Результат.Добавить("СтатьяРасходовВзносов");
	Результат.Добавить("АналитикаРасходовВзносов");
	Результат.Добавить("АналитикаАктивовПассивовВзносов");
	Результат.Добавить("ОсобыйСоответствуетОсновному");
	Результат.Добавить("СтатьяРасходовЕНВД");
	Результат.Добавить("АналитикаРасходовЕНВД");
	Результат.Добавить("АналитикаАктивовПассивовЕНВД");
	Результат.Добавить("РежимУчетаВзносовЕНВД");
	Результат.Добавить("СтатьяРасходовВзносовЕНВД");
	Результат.Добавить("АналитикаРасходовВзносовЕНВД");
	Результат.Добавить("АналитикаАктивовПассивовВзносовЕНВД");
	Результат.Добавить("ОтдельнаяСтатьяКалькуляции");
	Результат.Добавить("СтатьяКалькуляции");
	Результат.Добавить("ОтдельнаяСтатьяКалькуляцииВзносов");
	Результат.Добавить("БазаРаспределенияПоСдельнымРаботам");
	Результат.Добавить("ПринятиеКНалоговомуУчетуПоСдельнымРаботам");
	Результат.Добавить("РежимУчетаВзносовНаТравматизм");
	Результат.Добавить("СтатьяРасходовТравматизм");
	Результат.Добавить("АналитикаРасходовТравматизм");
	Результат.Добавить("АналитикаАктивовПассивовТравматизм");
	
	Результат.Добавить("ОплатаСдельныхРабот;ХарактерНачисления");
	
	Возврат Результат;
	
КонецФункции

// Проверяет использование объекта в документах Отражение зарплаты в финансовом учете и Начисление оценочных обязательств.
//	Параметры:
//		Параметры - Структура - структура, содержащая ссылку на проверяемый объект.
//		АдресХранилища - Строка - адрес, по которому следует поместить результат проверки.
//
Процедура ПроверитьИспользованиеОбъекта(Параметры, АдресХранилища) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	|	Зарплата.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОтражениеЗарплатыВФинансовомУчете.НачисленнаяЗарплатаИВзносы КАК Зарплата
	|ГДЕ
	|	Зарплата.Ссылка.Проведен
	|	И Зарплата.СпособОтраженияЗарплатыВБухучете = &Объект
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	|	Резервы.Ссылка
	|ИЗ
	|	Документ.НачислениеОценочныхОбязательствПоОтпускам.ОценочныеОбязательства КАК Резервы
	|ГДЕ
	|	Резервы.Ссылка.Проведен
	|	И Резервы.СпособОтраженияЗарплатыВБухучете = &Объект");
	
	Запрос.УстановитьПараметр("Объект", Параметры.Объект);
	Результат = Запрос.Выполнить();
	
	ПоместитьВоВременноеХранилище(Не Результат.Пустой(), АдресХранилища);
	
КонецПроцедуры

// Заполняет массивы реквизитов, зависимых от свойств документа
//
// Параметры:
//	ВидНаряда - ПеречислениеСсылка.ВидыБригадныхНарядов - вид бригадного наряда
//	ПоРаспоряжениям - Булево - признак оформления документа по распоряжениям
//	МассивВсехРеквизитов - Массив - реквизиты, которые зависят от свойств наряда
//	МассивРеквизитовОперации - Массив - реквизиты, которые используются при заданных свойствах наряда.
//
Функция НеИспользуемыеРеквизиты(Объект) Экспорт
	
	МассивВсехРеквизитов = Новый Массив;
	МассивВсехРеквизитов.Добавить("НаправлениеДеятельности");
	
	МассивВсехРеквизитов.Добавить("СтатьяРасходов");
	МассивВсехРеквизитов.Добавить("АналитикаРасходов");
	МассивВсехРеквизитов.Добавить("АналитикаАктивовПассивов");
	МассивВсехРеквизитов.Добавить("СчетУчета");
	МассивВсехРеквизитов.Добавить("Субконто1");
	МассивВсехРеквизитов.Добавить("Субконто2");
	МассивВсехРеквизитов.Добавить("Субконто3");
	
	МассивВсехРеквизитов.Добавить("СтатьяРасходовВзносов");
	МассивВсехРеквизитов.Добавить("АналитикаРасходовВзносов");
	МассивВсехРеквизитов.Добавить("АналитикаАктивовПассивовВзносов");
	МассивВсехРеквизитов.Добавить("СчетУчетаВзносов");
	МассивВсехРеквизитов.Добавить("Субконто1Взносов");
	МассивВсехРеквизитов.Добавить("Субконто2Взносов");
	МассивВсехРеквизитов.Добавить("Субконто3Взносов");
	
	МассивВсехРеквизитов.Добавить("СтатьяРасходовЕНВД");
	МассивВсехРеквизитов.Добавить("АналитикаРасходовЕНВД");
	МассивВсехРеквизитов.Добавить("АналитикаАктивовПассивовЕНВД");
	МассивВсехРеквизитов.Добавить("СчетУчетаЕНВД");
	МассивВсехРеквизитов.Добавить("Субконто1ЕНВД");
	МассивВсехРеквизитов.Добавить("Субконто2ЕНВД");
	МассивВсехРеквизитов.Добавить("Субконто3ЕНВД");
	
	МассивВсехРеквизитов.Добавить("СтатьяРасходовВзносовЕНВД");
	МассивВсехРеквизитов.Добавить("АналитикаРасходовВзносовЕНВД");
	МассивВсехРеквизитов.Добавить("АналитикаАктивовПассивовВзносовЕНВД");
	МассивВсехРеквизитов.Добавить("СчетУчетаВзносовЕНВД");
	МассивВсехРеквизитов.Добавить("Субконто1ВзносовЕНВД");
	МассивВсехРеквизитов.Добавить("Субконто2ВзносовЕНВД");
	МассивВсехРеквизитов.Добавить("Субконто3ВзносовЕНВД");
	
	МассивВсехРеквизитов.Добавить("ОплатаСдельныхРабот");
	МассивВсехРеквизитов.Добавить("ОтдельнаяСтатьяКалькуляции");
	МассивВсехРеквизитов.Добавить("СтатьяКалькуляции");
	МассивВсехРеквизитов.Добавить("ОтдельнаяСтатьяКалькуляцииВзносов");
	МассивВсехРеквизитов.Добавить("СтатьяКалькуляцииВзносов");
	МассивВсехРеквизитов.Добавить("БазаРаспределенияПоСдельнымРаботам");
	
	МассивВсехРеквизитов.Добавить("СтатьяРасходовТравматизм");
	МассивВсехРеквизитов.Добавить("АналитикаРасходовТравматизм");
	МассивВсехРеквизитов.Добавить("АналитикаАктивовПассивовТравматизм");
	МассивВсехРеквизитов.Добавить("СчетУчетаТравматизм");
	МассивВсехРеквизитов.Добавить("Субконто1Травматизм");
	МассивВсехРеквизитов.Добавить("Субконто2Травматизм");
	МассивВсехРеквизитов.Добавить("Субконто3Травматизм");
	
	МассивИспользуемыхРеквизитов = Новый Массив;
	
	Если Объект.ОплатаСдельныхРабот Тогда
		МассивИспользуемыхРеквизитов.Добавить("ОплатаСдельныхРабот");
		МассивИспользуемыхРеквизитов.Добавить("ОтдельнаяСтатьяКалькуляции");
		МассивИспользуемыхРеквизитов.Добавить("ОтдельнаяСтатьяКалькуляцииВзносов");
		МассивИспользуемыхРеквизитов.Добавить("БазаРаспределенияПоСдельнымРаботам");
		
		Если Объект.ОтдельнаяСтатьяКалькуляции Тогда
			МассивИспользуемыхРеквизитов.Добавить("СтатьяКалькуляции");
		КонецЕсли;
		Если Объект.ОтдельнаяСтатьяКалькуляцииВзносов Тогда
			МассивИспользуемыхРеквизитов.Добавить("СтатьяКалькуляцииВзносов");
		КонецЕсли;
		
	Иначе
		
		МассивИспользуемыхРеквизитов.Добавить("НаправлениеДеятельности");
		МассивИспользуемыхРеквизитов.Добавить("СтатьяРасходов");
		
		Если ТипЗнч(Объект.СтатьяРасходов) = Тип("ПланВидовХарактеристикСсылка.СтатьиАктивовПассивов") Тогда
			МассивИспользуемыхРеквизитов.Добавить("АналитикаАктивовПассивов");
			МассивИспользуемыхРеквизитов.Добавить("СчетУчета");
			МассивИспользуемыхРеквизитов.Добавить("Субконто1");
			МассивИспользуемыхРеквизитов.Добавить("Субконто2");
			МассивИспользуемыхРеквизитов.Добавить("Субконто3");
		Иначе
			МассивИспользуемыхРеквизитов.Добавить("АналитикаРасходов");
		КонецЕсли;
		
		Если Объект.РежимУчетаВзносов = 1 Тогда
			
			МассивИспользуемыхРеквизитов.Добавить("СтатьяРасходовВзносов");
			
			Если ТипЗнч(Объект.СтатьяРасходовВзносов) = Тип("ПланВидовХарактеристикСсылка.СтатьиАктивовПассивов") Тогда
				МассивИспользуемыхРеквизитов.Добавить("АналитикаАктивовПассивовВзносов");
				МассивИспользуемыхРеквизитов.Добавить("СчетУчетаВзносов");
				МассивИспользуемыхРеквизитов.Добавить("Субконто1Взносов");
				МассивИспользуемыхРеквизитов.Добавить("Субконто2Взносов");
				МассивИспользуемыхРеквизитов.Добавить("Субконто3Взносов");
			Иначе
				МассивИспользуемыхРеквизитов.Добавить("АналитикаРасходовВзносов");
			КонецЕсли;
		
		КонецЕсли;
		
		Если Не Объект.ОсобыйСоответствуетОсновному Тогда
			
			МассивИспользуемыхРеквизитов.Добавить("СтатьяРасходовЕНВД");
			
			Если ТипЗнч(Объект.СтатьяРасходовЕНВД) = Тип("ПланВидовХарактеристикСсылка.СтатьиАктивовПассивов") Тогда
				МассивИспользуемыхРеквизитов.Добавить("АналитикаАктивовПассивовЕНВД");
				МассивИспользуемыхРеквизитов.Добавить("СчетУчетаЕНВД");
				МассивИспользуемыхРеквизитов.Добавить("Субконто1ЕНВД");
				МассивИспользуемыхРеквизитов.Добавить("Субконто2ЕНВД");
				МассивИспользуемыхРеквизитов.Добавить("Субконто3ЕНВД");
			Иначе
				МассивИспользуемыхРеквизитов.Добавить("АналитикаРасходовЕНВД");
			КонецЕсли;
			
			Если Объект.РежимУчетаВзносовЕНВД = 1 Тогда
				
				МассивИспользуемыхРеквизитов.Добавить("СтатьяРасходовВзносовЕНВД");
				
				Если ТипЗнч(Объект.СтатьяРасходовВзносовЕНВД) = Тип("ПланВидовХарактеристикСсылка.СтатьиАктивовПассивов") Тогда
					МассивИспользуемыхРеквизитов.Добавить("АналитикаАктивовПассивовВзносовЕНВД");
					МассивИспользуемыхРеквизитов.Добавить("СчетУчетаВзносовЕНВД");
					МассивИспользуемыхРеквизитов.Добавить("Субконто1ВзносовЕНВД");
					МассивИспользуемыхРеквизитов.Добавить("Субконто2ВзносовЕНВД");
					МассивИспользуемыхРеквизитов.Добавить("Субконто3ВзносовЕНВД");
				Иначе
					МассивИспользуемыхРеквизитов.Добавить("АналитикаРасходовВзносовЕНВД");
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Объект.РежимУчетаВзносовНаТравматизм = 1 Тогда
		
		МассивИспользуемыхРеквизитов.Добавить("СтатьяРасходовТравматизм");
		
		Если ТипЗнч(Объект.СтатьяРасходовТравматизм) = Тип("ПланВидовХарактеристикСсылка.СтатьиАктивовПассивов") Тогда
			МассивИспользуемыхРеквизитов.Добавить("АналитикаАктивовПассивовТравматизм");
			МассивИспользуемыхРеквизитов.Добавить("СчетУчетаТравматизм");
			МассивИспользуемыхРеквизитов.Добавить("Субконто1Травматизм");
			МассивИспользуемыхРеквизитов.Добавить("Субконто2Травматизм");
			МассивИспользуемыхРеквизитов.Добавить("Субконто3Травматизм");
		Иначе
			МассивИспользуемыхРеквизитов.Добавить("АналитикаРасходовТравматизм");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ОбщегоНазначенияКлиентСервер.СократитьМассив(МассивВсехРеквизитов, МассивИспользуемыхРеквизитов);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

#КонецОбласти

#КонецОбласти

#КонецЕсли
